"""
Задание 1.

Каждое из слов «разработка», «сокет», «декоратор» представить
в буквенном формате и проверить тип и содержание соответствующих переменных.
Затем с помощью онлайн-конвертера преобразовать
в набор кодовых точек Unicode (НО НЕ В БАЙТЫ!!!)
и также проверить тип и содержимое переменных.

Подсказки:
--- 'разработка' - буквенный формат
--- '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430' - набор кодовых точек
--- используйте списки и циклы, не дублируйте функции
"""
words_list = ["разработка", "сокет", "декоратор"]
for word in words_list:
    code_point = b''
    print(f'{word} : {type(word)}')
    for i in word:
        code_point += i.encode("unicode-escape")
    code_point_str = code_point.decode()
    print(f'{code_point_str} : {type(code_point_str)}')
